MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
/**
  ******************************************************************************
  * @file    stm32c5xx_usb_drd_core.c
  * @brief   USB DRD core driver.
  *
  *          This file provides firmware functions to manage the following
  *          features of the USB Peripheral Controller:
  *           + Initialization/deinitialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_usb_drd_core.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (USB_DRD_FS)
/** @addtogroup USB_DRD_CORE USB DRD Core
  * @{
  */
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define USB_DRD_CORE_MIN(a,b) (((a) < (b)) ? (a) : (b))
#define USB_DRD_CORE_MAX(a,b) (((a) > (b)) ? (a) : (b))

/* Private variables ---------------------------------------------------------*/
/** @defgroup USB_DRD_CORE_Private_variables Private variables
  * @{
  */
static uint16_t  PhyChInState[USB_DRD_MAX_CHEP_NBR];  /*!< Physical Channel in State (Used/Free) */
static uint16_t  PhyChOutState[USB_DRD_MAX_CHEP_NBR]; /*!< Physical Channel out State (Used/Free) */
static uint32_t  PMALookupTable[USB_DRD_PMA_BLOCKS]; /*!< PMA lookup table */

static usb_drd_ep_config_t Chep0; /*!< host channel Endpoint0 configuration */
static usb_drd_ep_db_config_t EpDbState; /*!< Endpoint double buffer state */
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup USB_DRD_CORE_Private_Functions Private Functions
  * @{
  */
static usb_core_status_t USB_DRD_ResetCore(uint32_t instance);

static usb_core_status_t USB_DRD_CH_BULK_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch,
                                                      uint32_t ch_reg, uint32_t *p_length);

static usb_core_status_t USB_DRD_CH_ISO_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch,
                                                     uint32_t size_byte);

static uint8_t USB_DRD_IsUsedChannel(usb_core_channel_t ch_num);
static usb_core_phy_ch_t USB_DRD_GetFreePhysicalChannel(const usb_core_ch_t *p_ch);
static uint16_t USB_DRD_GetFreePMA(uint16_t mps);
static usb_core_status_t USB_DRD_PMAFree(uint32_t pma_base, uint16_t mps);
static usb_core_status_t USB_DRD_PMAlloc(usb_core_ch_t *p_ch, uint16_t ch_kind);
static usb_core_status_t USB_DRD_PMADeAlloc(usb_core_ch_t *p_ch);
static usb_core_status_t USB_DRD_SetChannelConfig(uint32_t instance, usb_core_ch_t *p_ch);
static usb_core_status_t USB_DRD_SetChannelDoubleBuffer(uint32_t instance, usb_core_phy_chep_t phy_ch_num,
                                                        usb_drd_db_status_t db_status);

static usb_core_status_t USB_DRD_SetChannelDirection(usb_core_ch_t *p_ch);
static usb_core_status_t USB_DRD_SetChannelEp0PmaAddress(usb_core_ch_t *p_ch);
static usb_core_status_t USB_DRD_SetEp0ChannelState(usb_core_ch_t *p_ch);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup USB_DRD_CORE_Private_Functions Private Functions
  * @{
  */

/**
  * @brief  Reset the USB core after a clock configuration change.
  * @param  instance Selected device
  * @retval USB core status
  */
static usb_core_status_t USB_DRD_ResetCore(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Disable Host Mode */
  p_usb->CNTR &= ~USB_CNTR_HOST;

  /* Force Reset IP */
  p_usb->CNTR |= USB_CNTR_USBRST;

  return USB_CORE_OK;
}

/**
  * @brief  Start a bulk transfer using double-buffer mode.
  * @param  instance Selected device.
  * @param  p_ch pointer to Host Channel structure.
  * @param  ch_reg snapshot of the CHEPR register.
  * @param  p_length Transfer Length pointer.
  * @retval DRD Core status
  */
static usb_core_status_t USB_DRD_CH_BULK_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch,
                                                      uint32_t ch_reg, uint32_t *p_length)
{
  if (p_ch->xfer_size > p_ch->max_packet)
  {
    /* Enable double buffer mode */
    (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_ENABLE);
    *p_length = p_ch->max_packet;
    p_ch->xfer_size -= *p_length;

    /* Prepare two buffers before enabling host */
    if ((ch_reg & USB_CH_DTOGTX) == 0U)
    {
      /* Write Buffer0 */
      USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr0, (uint16_t)*p_length);
    }
    else
    {
      /* Write Buffer1 */
      USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr1, (uint16_t)*p_length);
    }

    p_ch->p_xfer_buffer += *p_length;

    /* Multi packet transfer */
    if (p_ch->xfer_size > p_ch->max_packet)
    {
      p_ch->xfer_size -= *p_length;
    }
    else
    {
      *p_length = p_ch->xfer_size;
      p_ch->xfer_size = 0U;
    }

    if ((ch_reg & USB_CH_DTOGTX) == 0U)
    {
      /* Write Buffer1 */
      USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr1, (uint16_t)*p_length);
    }
    else
    {
      /* Write Buffer0 */
      USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr0, (uint16_t)*p_length);
    }
  }
  else
  {
    /* Disable bulk double buffer mode */
    (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_DISABLE);

