MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
    USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr0, (uint16_t)*p_length);
    USB_DRD_SET_CHEP_TX_CNT(instance, p_ch->phy_ch_num, (uint16_t)*p_length);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Start an isochronous transfer using double-buffer mode.
  * @param  instance Selected device.
  * @param  p_ch pointer to Host Channel structure.
  * @param  size_byte Transfer Length.
  * @retval DRD Core status
  */
static usb_core_status_t USB_DRD_CH_ISO_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch, uint32_t size_byte)
{
  /* Check the DTOG_TX to determine in which buffer to write */
  if ((USB_DRD_GET_CHEP(instance, p_ch->phy_ch_num) & USB_CH_DTOGTX) != 0U)
  {
    USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, size_byte);
    USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr0, (uint16_t)size_byte);
  }
  else
  {
    USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, size_byte);
    USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr1, (uint16_t)size_byte);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Check whether a logical channel is already mapped to a physical channel.
  * @param  ch_num  Channel number
  *         This parameter can be a value from 0 to 15.
  * @retval status
  */
static uint8_t USB_DRD_IsUsedChannel(usb_core_channel_t ch_num)
{
  uint8_t idx;

  /* Check whether the logical channel is already opened  */
  for (idx = 0U; idx < USB_DRD_MAX_CHEP_NBR; idx++)
  {
    if ((((PhyChInState[idx] & 0xF0U) >> 4U) == ((uint16_t)ch_num + 1U)) && (PhyChInState[idx] != 0U))
    {
      return (1U | (idx << 4U));
    }

    if ((((PhyChOutState[idx] & 0xF0U) >> 4U) == ((uint16_t)ch_num + 1U)) && (PhyChOutState[idx] != 0U))
    {
      return (1U | (idx << 4U));
    }
  }

  return 0U;
}

/**
  * @brief  Get a free physical channel number.
  * @param  p_ch Host Channel.
  * @retval if physical channel is available return Phy_channel number
  *       else return USB_DRD_FREE_CH_NOT_FOUND.
  */
static usb_core_phy_ch_t USB_DRD_GetFreePhysicalChannel(const usb_core_ch_t *p_ch)
{
  uint8_t idx;

  if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
  {
    idx = 0U;

    if (p_ch->ch_num == USB_CORE_CHANNEL_0)
    {
      if (PhyChInState[idx] == 0U)
      {
        /* Chin_state stores ep_type to reuse the same channel in OUT direction.
         * Add 1 to ep_type to avoid a default value of 0. ep_type uses 0, 1, 2, or 3 by default. */
        PhyChInState[idx] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                            ((uint16_t)p_ch->ep_type + 1U) |
                            ((uint16_t)p_ch->ep_num << 8U);
      }

      if (PhyChOutState[idx] == 0U)
      {
        /* Chout_state stores ep_type to reuse the same channel in IN direction.
         * Add 1 to ep_type to avoid a default value of 0. ep_type uses 0, 1, 2, or 3 by default. */
        PhyChOutState[idx] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                             ((uint16_t)p_ch->ep_type + 1U) |
                             ((uint16_t)p_ch->ep_num << 8U);
      }
    }
    else
    {
      if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
      {
        if (((PhyChInState[idx] & 0xF0U) >> 4U) != ((uint16_t)p_ch->ch_num + 1U))
        {
          /* Store the ep_type to be used for the same channel in OUT direction
           * adding + 1 to ep_type avoid starting with a 0 value. ep_type take by default (0/1/2/3) */
          PhyChInState[idx] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                              ((uint16_t)p_ch->ep_type + 1U) |
                              ((uint16_t)p_ch->ep_num << 8U);
        }
      }
      else
      {
        if (((PhyChOutState[idx] & 0xF0U) >> 4U) != ((uint16_t)p_ch->ch_num + 1U))
        {
          /* Store the ep_type to be used for the same channel in IN direction
           * adding + 1 to ep_type avoid starting with a 0 value. ep_type take by default (0/1/2/3) */
          PhyChOutState[idx] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                               ((uint16_t)p_ch->ep_type + 1U) |
                               ((uint16_t)p_ch->ep_num << 8U);
        }
      }
    }

    return (usb_core_phy_ch_t)idx;
  }

  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    /* Find a new available physical in channel */
    for (idx = 1U; idx < USB_DRD_MAX_CHEP_NBR; idx++)
    {
      /* If this endpoint number already has a channel, reuse its physical channel OUT for the IN logical channel */
      if ((PhyChInState[idx] == 0U) && ((((PhyChOutState[idx] & 0x000FU) == ((uint16_t)p_ch->ep_type + 1U))
                                         && (((PhyChOutState[idx] & 0x0F00U) == (uint16_t)p_ch->ep_num)))
                                        || (PhyChOutState[idx] == 0U)))
      {
        /* Store the ep_type to be used for the same channel in OUT direction
         * adding + 1 to ep_type avoid starting with a 0 value. ep_type take by default (0/1/2/3) */
        PhyChInState[idx] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                            ((uint16_t)p_ch->ep_type + 1U) |
                            ((uint16_t)p_ch->ep_num << 8U);

        return (usb_core_phy_ch_t)idx;
      }
    }
  }
  else
  {
    /* Find a new available physical out channel */
    for (idx = 1U; idx < USB_DRD_MAX_CHEP_NBR; idx++)
    {
      /* If this endpoint number already has a channel, reuse its physical channel IN for the OUT logical channel */
      if ((PhyChOutState[idx] == 0U) && ((((PhyChInState[idx] & 0x0FU) == ((uint16_t)p_ch->ep_type + 1U))
                                          && ((PhyChInState[idx] & 0x0F00U) == (uint16_t)p_ch->ep_num))
                                         || (PhyChInState[idx] == 0U)))
      {
        /* Chout_state stores the ep_type to be used for the same channel in IN direction
         * adding + 1 to ep_type avoid starting with a 0 value. ep_type take by default (0/1/2/3) */
        PhyChOutState[idx] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                             ((uint16_t)p_ch->ep_type + 1U) |
                             ((uint16_t)p_ch->ep_num << 8U);

        return (usb_core_phy_ch_t)idx;
      }
    }
  }

  /* No free channel available */
  return USB_CORE_PHY_CHEP_FF;
}

/**
  * @brief  Find a contiguous free PMA region for a given max packet size.
  * @param  mps  Channel Max Packet Size
  * @retval PMA_Address of the first free block containing mps byte
            0xFFFF in case of no space available
  */
static uint16_t USB_DRD_GetFreePMA(uint16_t mps)
{
  uint32_t entry;
  uint32_t free_blocks = 0U;
  uint16_t nbr_req_blocks;
  uint16_t mps_t = mps;
  uint8_t first_free_block_col = 0U;
  uint8_t first_free_block_line = 0U;
  uint8_t col_idx;

  /* Since PMA buffer descriptor RXBD allocate address according to BLSIZE, BLSIZE=1==> mps>64
    allocate PMA in 32-byte blocks */
  if ((mps_t > 64U) && ((mps_t % 32U) != 0U))
  {
    /* Align the mps to 32byte block to match the allocation in PMA,
      check Definition of allocation buffer memory in usb user spec */
    mps_t = (uint16_t)(((mps_t / 32U) + 1U) * 32U);
  }

