MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
  if (p_ch->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
  {
    status = USB_DRD_PMAFree(p_ch->pma_address, p_ch->max_packet);
  }
  else
  {
    status = USB_DRD_PMAFree(p_ch->pma_addr0, p_ch->max_packet);
    if (status != USB_CORE_OK)
    {
      error++;
    }

    status = USB_DRD_PMAFree(p_ch->pma_addr1, p_ch->max_packet);
    if (status != USB_CORE_OK)
    {
      error++;
    }

    if (error != 0U)
    {
      return USB_CORE_ERROR;
    }
  }

  return status;
}

/**
  * @brief  Configure channel single/double-buffer mode.
  * @param  instance Selected host
  * @param  phy_ch_num physical channel number
  * @param  db_status double state can be USB_DRD_XXX_DBUFF_ENABLE/USB_DRD_XXX_DBUFF_DISABLE
  * @retval USB core status
  */
static usb_core_status_t USB_DRD_SetChannelDoubleBuffer(uint32_t instance, usb_core_phy_chep_t phy_ch_num,
                                                        usb_drd_db_status_t db_status)
{
  uint32_t ch_reg;

  if ((db_status == USB_DRD_BULK_DB_ENABLE) || (db_status == USB_DRD_ISOC_DB_DISABLE))
  {
    ch_reg = (USB_DRD_GET_CHEP(instance, phy_ch_num) | USB_CH_EPKIND) & USB_CHEP_DB_MSK;
  }
  else
  {
    ch_reg = USB_DRD_GET_CHEP(instance, phy_ch_num) & (~USB_CH_EPKIND) & USB_CHEP_DB_MSK;
  }

  /* Update the channel register */
  USB_DRD_SET_CHEP(instance, phy_ch_num, ch_reg);

  return USB_CORE_OK;
}

/**
  * @brief  Configure a host channel register.
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval USB core status
  */
static usb_core_status_t USB_DRD_SetChannelConfig(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;
  usb_core_port_speed_t host_port_speed;
  uint32_t ch_reg;

  ch_reg = USB_DRD_GET_CHEP(instance, p_ch->phy_ch_num) & USB_CH_T_MASK;

  /* Set endpoint type */
  switch (p_ch->ep_type)
  {
    case USB_CORE_EP_TYPE_CTRL:
      ch_reg |= USB_EP_CONTROL;
      break;

    case USB_CORE_EP_TYPE_BULK:
      ch_reg |= USB_EP_BULK;
      break;

    case USB_CORE_EP_TYPE_INTR:
      ch_reg |= USB_EP_INTERRUPT;
      break;

    case USB_CORE_EP_TYPE_ISOC:
      ch_reg |= USB_EP_ISOCHRONOUS;
      break;

    default:
      status = USB_CORE_ERROR;
      break;
  }

  /* Clear device address, endpoint number and low-speed endpoint fields */
  ch_reg &= ~(USB_CHEP_DEVADDR |
              USB_CHEP_EA |
              USB_CHEP_LS_EP |
              USB_CHEP_NAK |
              USB_CHEP_EPKIND |
              USB_CHEP_ERR_TX |
              USB_CHEP_ERR_RX |
              (0xFUL << 27U));

  /* Set device address and Endpoint number associated to the channel */
  ch_reg |= (((uint32_t)p_ch->dev_addr << USB_CHEP_DEVADDR_Pos) |
             (uint32_t)p_ch->ep_num);

  host_port_speed = USB_DRD_GetHostPortSpeed(instance);

  /* Set the device speed in case using HUB FS with device LS */
  if ((p_ch->speed == USB_CORE_DEVICE_SPEED_LS) && (host_port_speed == USB_CORE_PORT_SPEED_FS))
  {
    ch_reg |= USB_CHEP_LS_EP;
  }

  USB_DRD_SET_CHEP(instance, p_ch->phy_ch_num, (ch_reg | USB_CH_VTRX | USB_CH_VTTX));

  if ((p_ch->ep_type == USB_CORE_EP_TYPE_ISOC) && (EpDbState.is_iso_db != USB_DRD_DBL_BUF))
  {
    (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_ISOC_DB_DISABLE);
  }

  if ((p_ch->ep_type == USB_CORE_EP_TYPE_BULK) && (EpDbState.is_bulk_db == USB_DRD_DBL_BUF))
  {
    (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_ENABLE);
  }

  return status;
}

/**
  * @brief  Set host channel direction.
  * @param  p_ch pointer to host Channel structure
  * @retval none
  */
static usb_core_status_t USB_DRD_SetChannelDirection(usb_core_ch_t *p_ch)
{
  usb_core_ep_direction_t ep_dir = (usb_core_ep_direction_t)p_ch->ch_dir;

  if (ep_dir == USB_CORE_EP_IN_DIR)
  {
    p_ch->ch_dir = USB_CORE_CH_IN_DIR;
  }
  else
  {
    p_ch->ch_dir = USB_CORE_CH_OUT_DIR;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Select the EP0 PMA address based on direction.
  * @param  p_ch pointer to host Channel structure
  * @retval none
  */
static usb_core_status_t USB_DRD_SetChannelEp0PmaAddress(usb_core_ch_t *p_ch)
{
  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    p_ch->pma_address = p_ch->pma_addr1;
  }
  else
  {
    p_ch->pma_address = p_ch->pma_addr0;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Set EP0 channel state.
  * @param  p_ch pointer to host Channel structure
  * @retval none
  */
static usb_core_status_t USB_DRD_SetEp0ChannelState(usb_core_ch_t *p_ch)
{
  if ((p_ch->ep_num == USB_CORE_ENDPOINT_0) && (Chep0.is_dual_allocated != 0U))
  {
    p_ch->pma_address = Chep0.pma_address;
    p_ch->pma_addr0 = Chep0.pma_addr0;
    p_ch->pma_addr1 = Chep0.pma_addr1;

    PhyChInState[0U] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                       ((uint16_t)p_ch->ep_type + 1U) |
                       ((uint16_t)p_ch->ep_num << 8U);

    PhyChOutState[0U] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                        ((uint16_t)p_ch->ep_type + 1U) |
                        ((uint16_t)p_ch->ep_num << 8U);
  }

  return USB_CORE_OK;
}
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup USB_DRD_CORE_Exported_Functions Exported Core Functions
  * @{
  */
/**
  * @brief  Initialize the USB core.
  * @param  instance USB Instance
  * @param  p_core_config USB Instance configuration parameters
  *         for the specified USB peripheral.
  * @retval USB core status
  */
usb_core_status_t USB_DRD_InitCore(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  usb_core_status_t ret;
  STM32_UNUSED(p_core_config);

  ret = USB_DRD_ResetCore(instance);

  /* Clear pending interrupts */
  p_usb->ISTR = 0U;

  return ret;
}

/**
  * @brief  Deinitialize the USB core.
  * @param  instance USB Instance
  * @retval USB core status
  */
usb_core_status_t USB_DRD_DeInitCore(uint32_t instance)
{
  STM32_UNUSED(instance);
  uint8_t idx;

  (void)USB_DRD_PMAReset();

