MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
  for (idx = 0U; idx < USB_DRD_MAX_CHEP_NBR; idx++)
  {
    PhyChInState[idx] = 0U;
    PhyChOutState[idx] = 0U;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Enable global USB interrupts.
  * @param  instance Selected device
  * @retval USB core status
  */
usb_core_status_t USB_DRD_EnableGlobalInterrupt(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t winterruptmask;

  /* Clear pending interrupts */
  p_usb->ISTR = 0U;

  winterruptmask = USB_CNTR_CTRM  | USB_CNTR_WKUPM |
                   USB_CNTR_SUSPM | USB_CNTR_ERRM |
                   USB_CNTR_SOFM | USB_CNTR_ESOFM |
                   USB_CNTR_RST_DCONM | USB_CNTR_L1REQM;

  /* Set interrupt mask */
  p_usb->CNTR = winterruptmask;

  return USB_CORE_OK;
}

/**
  * @brief  Disable global USB interrupts.
  * @param  instance Selected device
  * @retval USB core status
  */
usb_core_status_t USB_DRD_DisableGlobalInterrupt(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t winterruptmask;

  /* Set winterruptmask variable */
  winterruptmask = USB_CNTR_CTRM  | USB_CNTR_WKUPM |
                   USB_CNTR_SUSPM | USB_CNTR_ERRM |
                   USB_CNTR_SOFM | USB_CNTR_ESOFM |
                   USB_CNTR_RST_DCONM | USB_CNTR_L1REQM;

  /* Clear interrupt mask */
  p_usb->CNTR &= ~winterruptmask;

  return USB_CORE_OK;
}

/**
  * @brief  Select the current USB core mode.
  * @param  instance Selected device
  * @param  core_mode current core mode
  *          This parameter can be one of the these values:
  *            @arg USB_CORE_XXX_MODE Peripheral mode
  * @retval USB core status
  */
usb_core_status_t USB_DRD_SetCurrentMode(uint32_t instance, usb_core_mode_t core_mode)
{
  volatile uint32_t count = 0U;
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  if (core_mode == USB_CORE_DEVICE_MODE)
  {
    p_usb->CNTR &= ~USB_CNTR_HOST;
  }
  else if (core_mode == USB_CORE_HOST_MODE)
  {
    p_usb->CNTR |= USB_CNTR_HOST;
  }
  else
  {
    return USB_CORE_ERROR;
  }

  do
  {
    count++;
    if (count >= USB_CORE_CURRENT_MODE_MAX_DELAY_CYCLES)
    {
      return USB_CORE_ERROR;
    }
  } while (USB_DRD_GetCurrentMode(instance) != core_mode);

  return USB_CORE_OK;
}

/**
  * @brief  Get the current USB core mode.
  * @param  instance  Selected device
  * @retval return core mode  Host or Device
  *         This parameter can be one of these values:
  *         USB_CORE_DEVICE_MODE
  *         USB_CORE_HOST_MODE
  */
usb_core_mode_t USB_DRD_GetCurrentMode(uint32_t instance)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t current_mode = (p_usb->CNTR & USB_CNTR_HOST) >> 31U;

  return (usb_core_mode_t)current_mode;
}

/**
  * @brief  Get the global USB interrupt status.
  * @param  instance Selected device
  * @retval USB Global Interrupt status
  */
uint32_t USB_DRD_ReadInterrupts(uint32_t instance)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t istr_reg;

  istr_reg = p_usb->ISTR;
  return istr_reg;
}

/**
  * @brief  Clear USB interrupt flags.
  * @param  instance Selected device
  * @param  interrupt Interrupt flag
  */
void USB_DRD_ClearInterrupts(uint32_t instance, uint32_t interrupt)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  p_usb->ISTR &= (uint16_t)(~interrupt);
}

/**
  * @brief  Write data from a user buffer to PMA (packet memory area).
  * @param  instance USB peripheral instance register address
  * @param  p_src pointer to user memory area
  * @param  pma_address pma buffer address
  * @param  size_byte number of bytes to be copied to packet memory area
  */
void USB_DRD_WritePMA(uint32_t instance, uint8_t *p_src, uint16_t pma_address, uint16_t size_byte)
{
  STM32_UNUSED(instance);
  __IO uint32_t *p_pma_buffer_addr;
  uint32_t end_address = (uint32_t)pma_address + (uint32_t)size_byte;
  uint32_t remaining_data;
  uint32_t count;
  uint32_t count32b;
  uint16_t remaining_bytes;
  uint8_t *p_src_buffer;

  if ((p_src == (void *)0U) || (size_byte == 0U) || (end_address > (uint32_t)USB_DRD_PMA_SIZE))
  {
    return;
  }

  p_src_buffer = p_src;

  count32b = ((uint32_t)size_byte + 3U) >> 2U;

  /* The last non word data to be processed alone */
  remaining_bytes = size_byte % 4U;

  /* Check whether there is a remaining byte */
  if (remaining_bytes != 0U)
  {
    count32b--;
  }

  /* Get the PMA Buffer pointer */
  p_pma_buffer_addr = (__IO uint32_t *)(USB_DRD_PMAADDR + (uint32_t)pma_address);

  /* Write the Calculated Word into the PMA related Buffer */
  for (count = count32b; count != 0U; count--)
  {
    *p_pma_buffer_addr = __UNALIGNED_UINT32_READ(p_src_buffer);
    p_pma_buffer_addr++;
    p_src_buffer++;
    p_src_buffer++;
    p_src_buffer++;
    p_src_buffer++;
  }

  /* When number of data is not word-aligned, write the remaining bytes */
  if (remaining_bytes != 0U)
  {
    remaining_data = 0U;

    do
    {
      remaining_data |= (uint32_t)(*(uint8_t *)p_src_buffer) << (8U * count);
      count++;
      p_src_buffer++;
      remaining_bytes--;
    } while (remaining_bytes != 0U);

    *p_pma_buffer_addr = remaining_data;
  }
}

/**
  * @brief  Read data from PMA (packet memory area) to a user buffer.
  * @param   instance USB peripheral instance register address.
  * @param   p_dest pointer to user memory area
  * @param   pma_address address into PMA
  * @param   size_byte number of bytes to be copied to user memory buffer
  */
void USB_DRD_ReadPMA(uint32_t instance, uint8_t *p_dest, uint16_t pma_address, uint16_t size_byte)
{
  STM32_UNUSED(instance);
  __IO uint32_t *p_pma_buffer_addr;
  uint32_t end_address = (uint32_t)pma_address + (uint32_t)size_byte;
  uint32_t count;
  uint32_t remaining_data;
  uint32_t count32b;
  uint16_t remaining_bytes;
  uint8_t *p_dest_buffer;

  if ((p_dest == (void *)0U) || (size_byte == 0U) || (end_address > (uint32_t)USB_DRD_PMA_SIZE))
  {
    return;
  }

  p_dest_buffer = p_dest;

  count32b = ((uint32_t)size_byte + 3U) >> 2U;

  /* The last non word data to be processed alone */
  remaining_bytes = size_byte % 4U;

  /* Get the PMA Buffer pointer */
  p_pma_buffer_addr = (__IO uint32_t *)(USB_DRD_PMAADDR + (uint32_t)pma_address);

  /* If number of byte is not word aligned decrement the number of word */
  if (remaining_bytes != 0U)
  {
    count32b--;
  }

  /* Read data packet From the PMA Buffer */
  for (count = count32b; count != 0U; count--)
  {
    __UNALIGNED_UINT32_WRITE(p_dest_buffer, *p_pma_buffer_addr);

    p_pma_buffer_addr++;
    p_dest_buffer++;
    p_dest_buffer++;
    p_dest_buffer++;
    p_dest_buffer++;
  }

  /* When number of data is not word-aligned, read the remaining bytes */
  if (remaining_bytes != 0U)
  {
    remaining_data = *(__IO uint32_t *)p_pma_buffer_addr;

    do
    {
      *(uint8_t *)p_dest_buffer = (uint8_t)(remaining_data >> (8U * (uint8_t)(count)));
      count++;
      p_dest_buffer++;
      remaining_bytes--;
    } while (remaining_bytes != 0U);
  }
}

