MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
/*----------------------  PMA Allocation Section --------------------- */
/*
                __col31________________col0__   Column-- >
          lin0 | entry31.|.......  | entry0 |   Line
               |---------|---------|--------|    |
          line1| entry63.|.......  | entry32|    |
               |---------|---------|--------|   \|/
               | entry127|.......  | entry64|
               |---------|---------|--------|
               | entry256|......   |entry128|
                ----------------------------
           an allocation space of 64byte need 8 Free contiguous entry in the Matrix
           - a Free entry is a bit with 0 Value/  a busy entry is a bit with 1 value. */


/**
  * @brief  Reset the PMA allocation table.
  * @retval status
  */
usb_core_status_t USB_DRD_PMAReset(void)
{
  uint16_t index;

  /* Reset All PMA entry */
  for (index = 0U; index < USB_DRD_PMA_BLOCKS; index++)
  {
    PMALookupTable[index] = 0U;
  }

  /* Allocate a Space for buffer descriptor table depending on the Host channel number */
  for (index = 0U; index < USB_DRD_MAX_CHEP_NBR; index++)
  {
    PMALookupTable[0] |= ((uint32_t)1UL << index);
  }

  /* Reset Ep0 Pma allocation state */
  Chep0.virtual_ch_num = USB_CORE_CHANNEL_FF;
  Chep0.dir = USB_CORE_EP_OUT_DIR;
  Chep0.is_allocated = 0U;
  Chep0.is_dual_allocated = 0U;
  Chep0.pma_addr0 = 0U;
  Chep0.pma_addr1 = 0U;

  return USB_CORE_OK;
}

/**
  * @brief  Write a channel/endpoint register value.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  reg_value Register Value
  */
void USB_DRD_SET_CHEP(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t reg_value)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  *(__IO uint32_t *)(&p_usb->CHEP0R + (uint32_t)ch_ep_num) = reg_value;
}

/**
  * @brief  Read a channel/endpoint register value.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @retval Channel/endpoint number
  */
uint32_t USB_DRD_GET_CHEP(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  return (*(__IO const uint32_t *)(&p_usb->CHEP0R + (uint32_t)ch_ep_num));
}

/**
  * @brief  Toggle the DTOG_RX bit in the endpoint register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_RX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOGRX);
}

/**
  * @brief  Toggle the DTOG_TX bit in the endpoint register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_TX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOGTX);
}

/**
  * @brief  Set the SETUP bit to request a setup transaction.
  * @param  instance USB device
  * @param  ch_ep_num Channel/Endpoint number
  */
void USB_DRD_CHEP_TX_SETUP(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);

  /* Set Setup bit */
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value | USB_CHEP_SETUP);
}

/**
  * @brief  Clear the ERR_RX bit in the channel register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Channel/Endpoint number
  */
void USB_DRD_CLEAR_CHEP_RX_ERR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);
  reg_value = (reg_value & USB_CHEP_REG_MASK & (~USB_CHEP_ERR_RX)
               & (~USB_CHEP_VTRX)) | (USB_CHEP_VTTX | USB_CHEP_ERR_TX);

  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value);
}

/**
  * @brief  Clear the ERR_TX bit in the channel register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Channel/Endpoint number
  */
void USB_DRD_CLEAR_CHEP_TX_ERR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);
  reg_value = (reg_value & USB_CHEP_REG_MASK & (~USB_CHEP_ERR_TX)
               & (~USB_CHEP_VTTX)) | (USB_CHEP_VTRX | USB_CHEP_ERR_RX);

  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value);
}

/**
  * @brief  Set the TX status bits (STAT_TX[1:0]).
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  ep_ch_state new state
  */
void USB_DRD_SET_CHEP_TX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t ep_ch_state)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_TX_DTOGMASK;

  if ((USB_CHEP_TX_DTOG1 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_TX_DTOG1;
  }

  if ((USB_CHEP_TX_DTOG2 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_TX_DTOG2;
  }

  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));
}

/**
  * @brief  Set the RX status bits (STAT_RX[1:0]).
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  ep_ch_state new state
  */
void USB_DRD_SET_CHEP_RX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t ep_ch_state)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_RX_DTOGMASK;

  if ((USB_CHEP_RX_DTOG1 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_RX_DTOG1;
  }
  else
  {
    /* nothing to do */
  }

  if ((USB_CHEP_RX_DTOG2 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_RX_DTOG2;
  }
  else
  {
    /* nothing to do */
  }

  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));
}

/**
  * @brief  Get the TX status bits (STAT_TX[1:0]).
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @retval status for tx transfer
  */
uint16_t USB_DRD_GET_CHEP_TX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  return (uint16_t)(USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_STATTX);
}

/**
  * @brief  Get the RX status bits (STAT_RX[1:0]).
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @retval status for rx transfer
  */
uint16_t USB_DRD_GET_CHEP_RX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  return (uint16_t)(USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_STATRX);
}

/**
  * @brief  Set the EP_KIND bit.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_SET_CHEP_KIND(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_EPKIND));
}

/**
  * @brief  Clear the EP_KIND bit.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_CLEAR_CHEP_KIND(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

