MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_EP_KIND_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));
}

/**
  * @brief  Clear the CTR_RX flag in the endpoint register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_CLEAR_RX_CHEP_CTR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & (0xFFFF7FFFU & USB_CHEP_REG_MASK);
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTTX));
}

/**
  * @brief  Clear the CTR_TX flag in the endpoint register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_CLEAR_TX_CHEP_CTR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & (0xFFFFFF7FU & USB_CHEP_REG_MASK);
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX));
}

/**
  * @brief  Clear the DTOG_RX bit in the endpoint register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_CLEAR_RX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);

  if ((reg_value & USB_CHEP_DTOGRX) != 0U)
  {
    USB_DRD_RX_DTOG(instance, ch_ep_num);
  }
}

/**
  * @brief  Clear the DTOG_TX bit in the endpoint register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  */
void USB_DRD_CLEAR_TX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);

  if ((reg_value & USB_CHEP_DTOGTX) != 0U)
  {
    USB_DRD_TX_DTOG(instance, ch_ep_num);
  }
}

/**
  * @brief  Set the address field in an endpoint/channel register.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  address Address
  */
void USB_DRD_SET_CHEP_ADDRESS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t address)
{
  uint32_t reg_value;

  /* Read the CHEPx, reset toggle/status bits and set the endpoint address */
  reg_value = (USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK) | address;

  /* Write back and preserve Valid Transfer bits */
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));
}

/* PMA API Buffer Descriptor Management ------------------------------------------------------------*/

/**
  * @brief  Set the TX buffer descriptor address field.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  address TX address
  */
void USB_DRD_SET_CHEP_TX_ADDRESS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t address)
{
  STM32_UNUSED(instance);

  /* Reset old Address */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD &= USB_PMA_TXBD_ADDMSK;

  /* Bit0 & Bit1 must be 0: PMA is word-aligned */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD |= (uint32_t)(((uint32_t)address >> 2U) << 2U);
}

/**
  * @brief  Set the RX buffer descriptor address field.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  address RX address
  */
void USB_DRD_SET_CHEP_RX_ADDRESS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t address)
{
  STM32_UNUSED(instance);

  /* Reset old Address */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD &= USB_PMA_RXBD_ADDMSK;

  /* Bit0 & Bit1 must be 0: PMA is word-aligned */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD |= (uint32_t)(((uint32_t)address >> 2U) << 2U);
}

/**
  * @brief  Program the RX buffer count register from a byte count.
  * @param  p_rx_count Register pointer
  * @param  rx_count Counter
  */
void USB_DRD_SET_CHEP_CNT_RX_REG(volatile uint32_t *p_rx_count, uint32_t rx_count)
{
  uint32_t nbr_blocks;
  uint32_t reg_value;

  if (p_rx_count == (void *)0U)
  {
    return;
  }

  /* Build new register value locally and perform a single write-back */
  reg_value = (*p_rx_count) & ~(USB_DRD_CNTRX_BLSIZE | USB_DRD_CNTRX_NBLK_MSK);

  if (rx_count == 0U)
  {
    reg_value |= USB_DRD_CNTRX_BLSIZE;
  }
  else if (rx_count <= 62U)
  {
    nbr_blocks = (uint32_t)((uint32_t)rx_count >> 1U);

    if ((rx_count & 0x1U) != 0U)
    {
      nbr_blocks++;
    }

    reg_value |= (uint32_t)(nbr_blocks << 26U);
  }
  else
  {
    nbr_blocks = ((uint32_t)rx_count >> 5U);

    if (((uint32_t)(rx_count) % 32U) == 0U)
    {
      nbr_blocks--;
    }

    reg_value |= (uint32_t)(((nbr_blocks << 26U)) | USB_DRD_CNTRX_BLSIZE);
  }

  /* Single write to the RX count register */
  *p_rx_count = reg_value;
}

/**
  * @brief  Set the TX buffer count.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  tx_count Counter value
  */
void USB_DRD_SET_CHEP_TX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t tx_count)
{
  STM32_UNUSED(instance);

  /* Reset old TX_Count value */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD &= USB_PMA_TXBD_COUNTMSK;

  /* Set the TX count */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD |= (uint32_t)((uint32_t)tx_count << 16U);
}

/**
  * @brief  Set the RX double-buffer 0 count.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  rx_count Counter value
  */
void USB_DRD_SET_CHEP_RX_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t rx_count)
{
  STM32_UNUSED(instance);

  /* Set the rx count in the dedicated endpoint RX buffer */
  USB_DRD_SET_CHEP_CNT_RX_REG((volatile uint32_t *) & (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD, rx_count);
}

/**
  * @brief  Set the RX buffer count.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  rx_count Counter value
  */
void USB_DRD_SET_CHEP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t rx_count)
{
  STM32_UNUSED(instance);

