MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
  /* Set the rx count in the dedicated endpoint RX buffer */
  USB_DRD_SET_CHEP_CNT_RX_REG((volatile uint32_t *) & (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD, rx_count);
}

/**
  * @brief  Get the TX buffer count.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @retval Counter value
  */
uint16_t USB_DRD_GET_CHEP_TX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  STM32_UNUSED(instance);
  return (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD & 0x03FF0000U) >> 16U);
}

/**
  * @brief  Get the RX buffer count.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @retval Counter value
  */
uint16_t USB_DRD_GET_CHEP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  STM32_UNUSED(instance);
  return (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD & 0x03FF0000U) >> 16U);
}

/**
  * @brief  Set buffer 0 address in a double-buffer endpoint.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  buff0_addr buffer 0 address
  */
void USB_DRD_SET_CHEP_DBUF0_ADDR(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t buff0_addr)
{
  USB_DRD_SET_CHEP_TX_ADDRESS(instance, ch_ep_num, buff0_addr);
}

/**
  * @brief  Set buffer 1 address in a double-buffer endpoint.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  buff1_addr buffer 1 address
  */
void USB_DRD_SET_CHEP_DBUF1_ADDR(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t buff1_addr)
{
  USB_DRD_SET_CHEP_RX_ADDRESS(instance, ch_ep_num, buff1_addr);
}

/**
  * @brief  Set buffer addresses in a double-buffer endpoint.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  buff0_addr buffer 0 address
  * @param  buff1_addr buffer 1 address
  */
void USB_DRD_SET_CHEP_DBUF_ADDR(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                uint32_t buff0_addr, uint32_t buff1_addr)
{
  USB_DRD_SET_CHEP_DBUF0_ADDR(instance, ch_ep_num, buff0_addr);
  USB_DRD_SET_CHEP_DBUF1_ADDR(instance, ch_ep_num, buff1_addr);
}

/**
  * @brief  Set buffer 0 count of a double-buffer endpoint.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  direction Endpoint direction (USB_CORE_EP_OUT_DIR or USB_CORE_EP_IN_DIR)
  * @param  count Endpoint count value
  */
void USB_DRD_SET_CHEP_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                usb_core_ep_direction_t direction, uint32_t count)
{
  if (direction == USB_CORE_EP_OUT_DIR)
  {
    /* OUT endpoint */
    USB_DRD_SET_CHEP_RX_DBUF0_CNT(instance, ch_ep_num, count);
  }
  else
  {
    /* IN endpoint */
    USB_DRD_SET_CHEP_TX_CNT(instance, ch_ep_num, count);
  }
}

/**
  * @brief  Set buffer 1 count of a double-buffer endpoint.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  direction Endpoint direction (USB_CORE_EP_OUT_DIR or USB_CORE_EP_IN_DIR)
  * @param  count Endpoint count value
  */
void USB_DRD_SET_CHEP_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                usb_core_ep_direction_t direction, uint32_t count)
{
  if (direction == USB_CORE_EP_OUT_DIR)
  {
    /* OUT endpoint */
    USB_DRD_SET_CHEP_RX_CNT(instance, ch_ep_num, count);
  }
  else
  {
    /* IN endpoint */
    (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD &= USB_PMA_TXBD_COUNTMSK;
    (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD |= (uint32_t)((uint32_t)count << 16U);
  }
}

/**
  * @brief  Set buffer counts for a double-buffer endpoint.
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint number
  * @param  direction Endpoint direction (USB_CORE_EP_OUT_DIR or USB_CORE_EP_IN_DIR)
  * @param  count Endpoint count value
  */
void USB_DRD_SET_CHEP_DBUF_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                               usb_core_ep_direction_t direction, uint32_t count)
{
  USB_DRD_SET_CHEP_DBUF0_CNT(instance, ch_ep_num, direction, count);
  USB_DRD_SET_CHEP_DBUF1_CNT(instance, ch_ep_num, direction, count);
}
/**
  * @}
  */

/** @addtogroup USB_DRD_CORE_Device_Exported_Functions Exported Device Functions
  * @{
  */
/**
  * @brief  Get endpoint RX buffer count.
  * @param  instance USB peripheral instance register address
  * @param  ep_num Endpoint number
  * @retval Counter value
  */
uint16_t USB_DRD_GET_EP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ep_num)
{
  volatile uint32_t count = USB_DRD_RX_PMA_CNT;

  /* Few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_RX_CNT(instance, ep_num);
}


/**
  * @brief  Get endpoint double-buffer 0 RX count.
  * @param  instance USB peripheral instance register address
  * @param  ep_num Endpoint number
  * @retval Counter value
  */
uint16_t USB_DRD_GET_EP_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ep_num)
{
  volatile uint32_t count = USB_DRD_RX_PMA_CNT;

  /* Few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF0_CNT(instance, ep_num);
}


/**
  * @brief  Get endpoint double-buffer 1 RX count.
  * @param  instance USB peripheral instance register address
  * @param  ep_num Endpoint number
  * @retval Counter value
  */
uint16_t USB_DRD_GET_EP_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t ep_num)
{
  volatile uint32_t count = USB_DRD_RX_PMA_CNT;

  /* Few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF1_CNT(instance, ep_num);
}
/**
  * @}
  */

/** @addtogroup USB_DRD_CORE_Host_Exported_Functions Exported Host Functions
  * @{
  */
/**
  * @brief  Get channel RX buffer count.
  * @param  instance USB peripheral instance register address
  * @param  phy_ch_num physical channel number
  * @retval Counter value
  */
uint16_t USB_DRD_GET_CH_RX_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t ep_reg = USB_DRD_GET_CHEP(instance, phy_ch_num);
  volatile uint32_t count = 10U;

  /* Count depends on device LS */
  if (((p_usb->ISTR & USB_ISTR_LS_DCON) == USB_ISTR_LS_DCON) || ((ep_reg & USB_CHEP_LS_EP) == USB_CHEP_LS_EP))
  {
    count = (75U * (SystemCoreClock / 1000000U)) / 100U;
  }

