MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
  if (count > 15U)
  {
    count = USB_DRD_CORE_MAX(10U, (count - 15U));
  }

  /* Few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_RX_CNT(instance, phy_ch_num);
}

/**
  * @brief  Get channel double-buffer 0 RX count.
  * @param  instance USB peripheral instance register address.
  * @param  phy_ch_num physical channel number.
  * @retval Counter value
  */
uint16_t USB_DRD_GET_CH_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  volatile uint32_t count = 10U;

  /* Few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF0_CNT(instance, phy_ch_num);
}


/**
  * @brief  Get channel double-buffer 1 RX count.
  * @param  instance USB peripheral instance register address.
  * @param  phy_ch_num physical channel number.
  * @retval Counter value
  */
uint16_t USB_DRD_GET_CH_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  volatile uint32_t count = 10U;

  /* Few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF1_CNT(instance, phy_ch_num);
}
/**
  * @}
  */

/** @addtogroup USB_DRD_CORE_Device_Exported_Functions Exported Device Functions
  * @{
  */
/**
  * @brief  Initialize the USB DRD PCD driver interface.
  * @param  p_driver pointer to USB PCD driver structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_PCD_InitDriver(usb_core_pcd_driver_t *p_driver)
{
  p_driver->core_init = USB_DRD_InitCore;
  p_driver->core_set_mode = USB_DRD_SetCurrentMode;
  p_driver->core_get_mode = USB_DRD_GetCurrentMode;
  p_driver->core_enable_interrupts = USB_DRD_EnableGlobalInterrupt;
  p_driver->core_disable_interrupts = USB_DRD_DisableGlobalInterrupt;
  p_driver->device_init = USB_DRD_InitDevice;
  p_driver->device_start = USB_DRD_StartDevice;
  p_driver->device_stop = USB_DRD_StopDevice;
  p_driver->device_connect = USB_DRD_ConnectDevice;
  p_driver->device_disconnect = USB_DRD_DisconnectDevice;
  p_driver->device_set_address = USB_DRD_SetDeviceAddress;
  p_driver->device_get_speed = USB_DRD_GetDeviceSpeed;
  p_driver->ep_activate = USB_DRD_ActivateEndpoint;
  p_driver->ep_deactivate = USB_DRD_DeactivateEndpoint;
  p_driver->ep_start_transfer = USB_DRD_StartEndpointXfer;
  p_driver->ep_stop_transfer = USB_DRD_StopEndpointXfer;
  p_driver->ep_set_stall = USB_DRD_SetEndpointStall;
  p_driver->ep_clear_stall = USB_DRD_ClearEndpointStall;
  p_driver->remote_wakeup_activate = USB_DRD_ActivateRemoteWakeup;
  p_driver->remote_wakeup_deactivate = USB_DRD_DeActivateRemoteWakeup;

  p_driver->lpm_activate = USB_DRD_LPM_Activate;
  p_driver->lpm_deactivate = USB_DRD_LPM_DeActivate;

  p_driver->bcd_activate = USB_DRD_BCD_Activate;
  p_driver->bcd_deactivate = USB_DRD_BCD_DeActivate;
  p_driver->bcd_set_mode = USB_DRD_BCD_SetMode;
  p_driver->bcd_detect_port_type = USB_DRD_BCD_SetPortDetection;

  return USB_CORE_OK;
}

/**
  * @brief  Configure BCD mode.
  * @param  instance Selected device
  * @param  bcd_config
  * @param  bcd_sts
  * @retval DRD core status
  */
usb_core_status_t  USB_DRD_BCD_SetMode(uint32_t instance,
                                       usb_core_bcd_config_t bcd_config, usb_core_bcd_config_sts_t bcd_sts)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  usb_core_status_t status = USB_CORE_OK;

  switch (bcd_config)
  {
    case USB_CORE_BCD_CONFIG_PD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->BCDR |= USB_BCDR_PDEN;
      }
      else
      {
        p_usb->BCDR &= ~USB_BCDR_PDEN;
      }
      break;

    case USB_CORE_BCD_CONFIG_SD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->BCDR |= USB_BCDR_SDEN;
      }
      else
      {
        p_usb->BCDR &= ~USB_BCDR_SDEN;
      }
      break;

    default:
      status = USB_CORE_ERROR;
      break;
  }

  return status;
}


/**
  * @brief  Detect BCD port type.
  * @param  instance Selected device
  * @param  detection Primary and Secondary detection
  * @retval port detection status
  */
usb_core_bcd_port_status_t USB_DRD_BCD_SetPortDetection(uint32_t instance, usb_core_bcd_detection_t detection)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  usb_core_bcd_port_status_t port_detection_status = USB_CORE_BCD_PORT_STATUS_DEFAULT;

  if (detection == USB_CORE_BCD_PRIMARY_DETECTION)
  {
    /* If Charger detect ? */
    if ((p_usb->BCDR & USB_BCDR_PDET) == USB_BCDR_PDET)
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_NOT_STD_DOWNSTREAM;
    }
    else
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_STD_DOWNSTREAM;
    }
  }
  else if (detection == USB_CORE_BCD_SECONDARY_DETECTION)
  {
    /* If CDP ? */
    if ((p_usb->BCDR & USB_BCDR_SDET) == USB_BCDR_SDET)
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_DEDICATED_CHARGING;
    }
    else
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_CHARGING_DOWNSTREAM;
    }
  }
  else
  {
    /* Nothing to Do */
  }

  return port_detection_status;
}

/**
  * @brief  Enable the battery charging detection (BCD) feature.
  * @param  instance Selected instance
  * @retval USB core status
  */
usb_core_status_t USB_DRD_BCD_Activate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  p_usb->BCDR &= ~(USB_BCDR_PDEN);
  p_usb->BCDR &= ~(USB_BCDR_SDEN);

  /* Enable BCD feature */
  p_usb->BCDR |= USB_BCDR_BCDEN;

  return USB_CORE_OK;
}

/**
  * @brief  Disable the battery charging detection (BCD) feature.
  * @param  instance Selected instance
  * @retval USB core status
  */
usb_core_status_t USB_DRD_BCD_DeActivate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Disable BCD feature */
  p_usb->BCDR &= ~(USB_BCDR_BCDEN);

  return USB_CORE_OK;
}


/**
  * @brief  Enable Link Power Management (LPM).
  * @param  instance Selected instance
  * @retval USB core status
  */
usb_core_status_t USB_DRD_LPM_Activate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

