MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
    /* Set buffer address for double buffered mode */
    USB_DRD_PCD_SET_EP_DBUF_ADDR(instance, phy_ep_num, p_ep->pma_addr0, p_ep->pma_addr1);

    if (p_ep->dir == USB_CORE_EP_OUT_DIR)
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      USB_DRD_PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      USB_DRD_PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      /* Set endpoint RX count */
      USB_DRD_PCD_SET_EP_DBUF_CNT(instance, phy_ep_num, p_ep->dir, p_ep->max_packet);

      /* Set endpoint RX to valid state */
      USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
      USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
    }
    else
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      USB_DRD_PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      USB_DRD_PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
      }
      else
      {
        /* Configure TX for ISOC Endpoint to disabled state */
        USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      }

      USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  Deactivate and deinitialize an endpoint.
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_DeactivateEndpoint(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  if ((uint8_t)p_ep->num > USB_DRD_MAX_CHEP_NBR)
  {
    return USB_CORE_ERROR;
  }

  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
  {
    if (p_ep->dir == USB_CORE_EP_IN_DIR)
    {
      USB_DRD_PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      /* Configure DISABLE status for the Endpoint */
      USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
    }
    else
    {
      USB_DRD_PCD_CLEAR_RX_DTOG(instance, phy_ep_num);

      /* Configure DISABLE status for the Endpoint */
      USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
    }
  }
  /* Double Buffer */
  else
  {
    if (p_ep->dir == USB_CORE_EP_OUT_DIR)
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      USB_DRD_PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      USB_DRD_PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      /* Reset value of the data toggle bits for the endpoint OUT */
      USB_DRD_PCD_TX_DTOG(instance, phy_ep_num);

      USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
      USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
    }
    else
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      USB_DRD_PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      USB_DRD_PCD_CLEAR_TX_DTOG(instance, phy_ep_num);
      USB_DRD_PCD_RX_DTOG(instance, phy_ep_num);

      /* Configure DISABLE status for the Endpoint */
      USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  Set up and start a transfer on an endpoint.
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_StartEndpointXfer(uint32_t instance, usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;
  uint32_t length;
  uint16_t pma_buffer;
  uint16_t ep_value;

  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  /* IN endpoint */
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    /* Multi packet transfer */
    if (p_ep->xfer_length > p_ep->max_packet)
    {
      length = p_ep->max_packet;
    }
    else
    {
      length = p_ep->xfer_length;
    }

    /* Configure and validate Tx endpoint */
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, p_ep->pma_address, (uint16_t)length);
      USB_DRD_PCD_SET_EP_TX_CNT(instance, phy_ep_num, length);
    }
    else
    {
      /* Double buffer bulk management */
      if (p_ep->type == USB_CORE_EP_TYPE_BULK)
      {
        p_ep->xfer_fill_db = 1U;

        if (p_ep->xfer_size > p_ep->max_packet)
        {
          /* Enable double buffer */
          USB_DRD_PCD_SET_BULK_EP_DBUF(instance, phy_ep_num);

          /* After each PMA write, decrement xfer_size to track remaining bytes */
          p_ep->xfer_size -= length;

          /* Fill the two first buffer in the Buffer0 & Buffer1 */
          if ((USB_DRD_PCD_GET_ENDPOINT(instance, phy_ep_num) & USB_EP_DTOGTX) != 0U)
          {
            /* Set the Double buffer counter for pmabuffer1 */
            USB_DRD_PCD_SET_EP_DBUF1_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr1;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
            p_ep->p_xfer_buffer += length;

            if (p_ep->xfer_size > p_ep->max_packet)
            {
              p_ep->xfer_size -= length;
            }
            else
            {
              length = p_ep->xfer_size;
              p_ep->xfer_size = 0U;
            }

            /* Set the Double buffer counter for pmabuffer0 */
            USB_DRD_PCD_SET_EP_DBUF0_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr0;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
          }
          else
          {
            /* Set the Double buffer counter for pmabuffer0 */
            USB_DRD_PCD_SET_EP_DBUF0_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr0;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
            p_ep->p_xfer_buffer += length;

            if (p_ep->xfer_size > p_ep->max_packet)
            {
              p_ep->xfer_size -= length;
            }
            else
            {
              length = p_ep->xfer_size;
              p_ep->xfer_size = 0U;
            }

            /* Set the Double buffer counter for pmabuffer1 */
            USB_DRD_PCD_SET_EP_DBUF1_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr1;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
          }
        }
        /* Auto Switch to single buffer mode when transfer <Mps no need to manage in double buffer */
        else
        {
          length = p_ep->xfer_size;

          /* Disable double buffer mode for Bulk endpoint */
          USB_DRD_PCD_CLEAR_BULK_EP_DBUF(instance, phy_ep_num);

          /* Set TX count to the number of bytes to transmit */
          USB_DRD_PCD_SET_EP_TX_CNT(instance, phy_ep_num, length);
          pma_buffer = p_ep->pma_addr0;

          /* Write the user buffer to USB PMA */
          USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
        }
      }
      else /* Manage isochronous double buffer IN mode */
      {
        /* After each PMA write, decrement xfer_size to track remaining bytes */
        p_ep->xfer_size -= length;

        /* Fill the data buffer */
        if ((USB_DRD_PCD_GET_ENDPOINT(instance, phy_ep_num) & USB_EP_DTOGTX) != 0U)
        {
          /* Set the Double buffer counter for pmabuffer1 */
          USB_DRD_PCD_SET_EP_DBUF1_CNT(instance, phy_ep_num, p_ep->dir, length);
          pma_buffer = p_ep->pma_addr1;

          /* Write the user buffer to USB PMA */
          USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
        }
        else
        {
          /* Set the Double buffer counter for pmabuffer0 */
          USB_DRD_PCD_SET_EP_DBUF0_CNT(instance, phy_ep_num, p_ep->dir, length);
          pma_buffer = p_ep->pma_addr0;

          /* Write the user buffer to USB PMA */
          USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
        }
      }
    }

