MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
    USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_VALID);
  }
  else /* OUT endpoint */
  {
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if ((p_ep->xfer_length == 0U) && (p_ep->type == USB_CORE_EP_TYPE_CTRL))
      {
        /* This is a status out stage set the OUT_STATUS */
        USB_DRD_PCD_SET_OUT_STATUS(instance, phy_ep_num);
      }
      else
      {
        USB_DRD_PCD_CLEAR_OUT_STATUS(instance, phy_ep_num);
      }

      /* Multi packet transfer */
      if (p_ep->xfer_length > p_ep->max_packet)
      {
        p_ep->xfer_length -= p_ep->max_packet;
      }
      else
      {
        p_ep->xfer_length = 0U;
      }
    }
    else
    {
      /* Set the Double buffer counter */
      if (p_ep->type == USB_CORE_EP_TYPE_BULK)
      {
        /* Coming from ISR */
        if (p_ep->xfer_count != 0U)
        {
          /* Update last value to check whether there is blocking state */
          ep_value = (uint16_t)USB_DRD_PCD_GET_ENDPOINT(instance, phy_ep_num);

          /* Blocking State */
          if ((((ep_value & USB_EP_DTOGRX) != 0U) && ((ep_value & USB_EP_DTOGTX) != 0U))
              || (((ep_value & USB_EP_DTOGRX) == 0U) && ((ep_value & USB_EP_DTOGTX) == 0U)))
          {
            /* OUT double buffered endpoint */
            USB_DRD_TX_DTOG(instance, phy_ep_num);
          }
        }
      }
      /* ISO OUT double buffer */
      else if (p_ep->type == USB_CORE_EP_TYPE_ISOC)
      {
        /* Only single packet transfer supported in FS */
        p_ep->xfer_length = 0U;
      }
      else
      {
        return USB_CORE_ERROR;
      }
    }

    USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
  }

  return USB_CORE_OK;
}


/**
  * @brief  Set a STALL condition on an endpoint.
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_SetEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_STALL);
  }
  else
  {
    USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_STALL);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Clear a STALL condition on an endpoint.
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_ClearEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    USB_DRD_PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

    if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
    {
      /* Configure NAK status for all non ISOC Endpoint */
      USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
    }
  }
  else
  {
    USB_DRD_PCD_CLEAR_RX_DTOG(instance, phy_ep_num);

    /* Configure VALID status for the Endpoint */
    USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Stop a transfer on an endpoint.
  * @param  instance  usb device instance
  * @param  p_ep pointer to endpoint structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_StopEndpointXfer(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  if ((uint8_t)p_ep->num > USB_DRD_MAX_CHEP_NBR)
  {
    return USB_CORE_ERROR;
  }

  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  /* IN endpoint */
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
      }
      else
      {
        /* Configure TX for ISOC Endpoint to disabled state */
        USB_DRD_PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      }
    }
  }
  else /* OUT endpoint */
  {
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_NAK);
      }
      else
      {
        /* Configure RX for ISOC Endpoint to disabled state */
        USB_DRD_PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
      }
    }
  }

  return USB_CORE_OK;
}
/**
  * @}
  */

/** @addtogroup USB_DRD_CORE_Host_Exported_Functions Exported Host Functions
  * @{
  */

/**
  * @brief  Initialize the USB DRD HCD driver interface.
  * @param  p_driver pointer USB HCD driver structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_HCD_InitDriver(usb_core_hcd_driver_t *p_driver)
{
  p_driver->core_init = USB_DRD_InitCore;
  p_driver->core_deinit = USB_DRD_DeInitCore;
  p_driver->core_set_mode = USB_DRD_SetCurrentMode;
  p_driver->core_get_mode = USB_DRD_GetCurrentMode;
  p_driver->core_enable_interrupts = USB_DRD_EnableGlobalInterrupt;
  p_driver->core_disable_interrupts = USB_DRD_DisableGlobalInterrupt;
  p_driver->core_get_dma_status = USB_DRD_GetDmaStatus;
  p_driver->host_init = USB_DRD_InitHost;
  p_driver->host_start = USB_DRD_StartHost;
  p_driver->host_stop = USB_DRD_StopHost;
  p_driver->host_channel_init = USB_DRD_InitChannel;
  p_driver->host_channel_start = USB_DRD_StartChannelXfer;
  p_driver->host_channel_halt = USB_DRD_HaltChannel;
  p_driver->host_channel_close = USB_DRD_CloseChannel;
  p_driver->host_port_reset = USB_DRD_PortReset;
  p_driver->host_port_suspend = USB_DRD_PortSuspend;
  p_driver->host_port_resume = USB_DRD_PortResume;
  p_driver->host_get_current_frame = USB_DRD_GetCurrentFrame;
  p_driver->host_get_port_speed = USB_DRD_GetHostPortSpeed;

  return USB_CORE_OK;
}

/**
  * @brief  Initialize the USB controller registers for host mode.
  * @param  instance Selected device
  * @param  p_core_config USB Instance configuration parameters
  *         for the specified USB peripheral.
  * @retval USB core status
  */
usb_core_status_t USB_DRD_InitHost(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Clear All Pending Interrupt */
  p_usb->ISTR = 0U;

  /* Disable all interrupts */
  p_usb->CNTR &= ~(USB_CNTR_CTRM | USB_CNTR_PMAOVRM | USB_CNTR_ERRM |
                   USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RST_DCONM |
                   USB_CNTR_SOFM | USB_CNTR_ESOFM | USB_CNTR_L1REQM);

  /* Clear All Pending Interrupt */
  p_usb->ISTR = 0U;

  /* Enable PHY pull-down and global interrupts */
  p_usb->BCDR |= USB_BCDR_DPPU_DPD;

