MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.c
  /* Enable Global interrupt */
  p_usb->CNTR |= (USB_CNTR_CTRM | USB_CNTR_PMAOVRM | USB_CNTR_ERRM |
                  USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RST_DCONM |
                  USB_CNTR_SOFM | USB_CNTR_ESOFM | USB_CNTR_L1REQM);

  /* Init PMA */
  (void)USB_DRD_PMAReset();

  /* Isochronous endpoint double-buffer state */
  EpDbState.is_iso_db = (usb_drd_doublebuffer_t)p_core_config->iso_db_state;

  /* Bulk endpoint double-buffer state */
  EpDbState.is_bulk_db = (usb_drd_doublebuffer_t)p_core_config->bulk_db_state;

  return USB_CORE_OK;
}

/**
  * @brief  Initialize a host channel.
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_InitChannel(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;
  uint32_t phy_channel;
  uint32_t used_channel;

  if (p_ch->ch_num > USB_CORE_CHANNEL_15)
  {
    return USB_CORE_ERROR;
  }

  /* update EP0 channel state */
  (void)USB_DRD_SetEp0ChannelState(p_ch);

  /* Check whether the logical channel are already allocated */
  used_channel = USB_DRD_IsUsedChannel(p_ch->ch_num);

  /* Check whether the channel is not already opened */
  if (used_channel == 0U)
  {
    /* Allocate New Physical channel */
    p_ch->phy_ch_num = USB_DRD_GetFreePhysicalChannel(p_ch);

    /* No free Channel available, return error */
    if (p_ch->phy_ch_num == USB_CORE_PHY_CHEP_FF)
    {
      return USB_CORE_ERROR;
    }
  }
  /* Channel already opened */
  else
  {
    /* Get Physical Channel number */
    phy_channel = (uint32_t)((used_channel & 0xF0U) >> 4U);
    p_ch->phy_ch_num = (usb_core_phy_chep_t)phy_channel;
  }

  /* Set Channel direction */
  (void)USB_DRD_SetChannelDirection(p_ch);

  /* Check whether the channel is not already opened */
  if (used_channel == 0U)
  {
    if (((p_ch->ep_type == USB_CORE_EP_TYPE_ISOC) && (EpDbState.is_iso_db == USB_DRD_DBL_BUF))
        || ((p_ch->ep_type == USB_CORE_EP_TYPE_BULK) && (EpDbState.is_bulk_db == USB_DRD_DBL_BUF)))
    {
      /* PMA Dynamic Allocation */
      status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_DBL_BUF);

      if (status == USB_CORE_ERROR)
      {
        return USB_CORE_ERROR;
      }

      /* Clear Channel DTOG_TX */
      USB_DRD_HCD_CLEAR_TX_DTOG(instance, p_ch->phy_ch_num);

      /* Clear Channel DTOG RX */
      USB_DRD_HCD_CLEAR_RX_DTOG(instance, p_ch->phy_ch_num);
    }
    else
    {
      if (p_ch->ep_num != USB_CORE_ENDPOINT_0)
      {
        status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

        if (status == USB_CORE_ERROR)
        {
          return USB_CORE_ERROR;
        }
      }
      else
      {
        if (p_ch->ch_num == USB_CORE_CHANNEL_0)
        {
          if ((Chep0.virtual_ch_num != USB_CORE_CHANNEL_0) && (Chep0.dir == USB_CORE_EP_IN_DIR))
          {
            if (p_ch->ch_dir == USB_CORE_CH_OUT_DIR)
            {
              status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

              if (status == USB_CORE_ERROR)
              {
                return USB_CORE_ERROR;
              }
            }
            else
            {
              return USB_CORE_ERROR;
            }
          }
          else
          {
            /* This is a dual EP0 PMA allocation */
            Chep0.is_dual_allocated = 0x1U;

            /* PMA Dynamic Allocation for EP0 OUT direction */
            p_ch->ch_dir = USB_CORE_CH_OUT_DIR;
            status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

            if (status == USB_CORE_ERROR)
            {
              return USB_CORE_ERROR;
            }

            /* PMA Dynamic Allocation for EP0 IN direction */
            p_ch->ch_dir = USB_CORE_CH_IN_DIR;
            status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

            if (status == USB_CORE_ERROR)
            {
              return USB_CORE_ERROR;
            }
          }
        }
        else
        {
          if (Chep0.is_allocated == 1U)
          {
            if (Chep0.dir == USB_CORE_EP_IN_DIR)
            {
              p_ch->pma_addr1 = Chep0.pma_addr1;
            }
            else
            {
              p_ch->pma_addr0 = Chep0.pma_addr0;
            }
          }
          else
          {
            status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

            if (status == USB_CORE_ERROR)
            {
              return USB_CORE_ERROR;
            }
          }
        }
      }
    }
  }

  /* Restore the Channel direction */
  (void)USB_DRD_SetChannelDirection(p_ch);

  /* Set EP0 channel PMA buffer address */
  if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
  {
    (void)USB_DRD_SetChannelEp0PmaAddress(p_ch);
  }

  /* Set physical channel configuration */
  status = USB_DRD_SetChannelConfig(instance, p_ch);

  return status;
}

/**
  * @brief  Close a host channel.
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_CloseChannel(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;

  /* Stop the channel */
  (void)USB_DRD_HaltChannel(instance, p_ch);

  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    /* Free Allocated Channel */
    PhyChInState[p_ch->phy_ch_num] = 0U;
  }
  else
  {
    /* Free Allocated Channel */
    PhyChOutState[p_ch->phy_ch_num] = 0U;
  }

  /* Reset PMA Channel_Allocation */
  (void)USB_DRD_PMADeAlloc(p_ch);

  return status;
}

/**
  * @brief  Halt a host channel.
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval USB core status
  */
usb_core_status_t USB_DRD_HaltChannel(uint32_t instance, const usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;

  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    (void)USB_DRD_HaltInChannel(instance, p_ch->phy_ch_num);
  }
  else
  {
    (void)USB_DRD_HaltOutChannel(instance, p_ch->phy_ch_num);
  }

  return status;
}

/**
  * @brief  Start a transfer on a host channel.
  * @param  instance Selected host
  * @param  p_ch pointer to host channel structure
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_StartChannelXfer(uint32_t instance, usb_core_ch_t *p_ch)
{
  uint32_t length;
  uint32_t ch_reg = USB_DRD_GET_CHEP(instance, p_ch->phy_ch_num);

  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)  /* In Channel */
  {
    /* Multi packet transfer */
    if (p_ch->xfer_length > p_ch->max_packet)
    {
      length = p_ch->max_packet;
    }
    else
    {
      length = p_ch->xfer_length;
    }

